{"92549a14":[{"text":"As far as I know, you can move clients between displays using Mod4 + o (using awful.client.movetoscreen).\r\nI myself have a TwinView setup, so I can't say if this works with XRandR (it should, however).\r\n~ Wolfgang","date":"2012-05-22 20:49:23"},{"text":"Works perfectly. : ) Thanks for pointing that out. If I just had carefully read through the man page of awesome instead of trying to find a solution via Google. ^^","date":"2012-05-22 20:49:45"}],"317f2497":[{"text":"Freut mich, dass sich noch jemand für awesome begeistern kann. Habs schon seit knapp 5 Monaten und will nicht mehr zurück.\r\nemelFM2 muss ich gleich mal ausprobieren. Setze bis jetzt immer noch auf vim mit NERDTree. - Wolfgang","date":"2011-12-26 20:51:11"},{"text":"Wow, NERDTree ist auch schick — das bleibt drauf. :D\r\n\r\nWas grafische Filemanager angeht hatte ich erst qtfm, fand's den aber nicht so toll und bin dann eben zu emelFM2 gewechselt. Schick find ich bei dem, dass man unten immer ne Konsole mit dran hat. Konfigurationsmöglichkeiten scheinen auch zu passen.\r\nNya, bin noch immer am Ausprobieren, Einrichten, Rumbasteln ... (nebenher, weil das Wichtigste schon alles läuft. ^^)\r\n\r\nDanke für den Kommentar. ; )","date":"2011-12-26 20:51:41"}],"ab2c19b1":[{"text":"I reckon the story stuff just appeared as you switched from german to english - change it back and enjoy your day ;)\r\n\r\ngreetings from sydney\r\nstefan (who just wanted to check whether you are listet on the waybackmachine ^_^)","date":"2011-09-21 20:53:02"},{"text":"Oh well ... since this ''incident'' happened like a month ago I'm now used to the story layout, so I won't change it at the cost of setting Facebook to German again. Sadly still 90% of all news items marked as top stories aren't really relevant to my interest or important by any means — I really wonder what Facebook is doing there.\r\n\r\nNice to hear from you btw. : )\r\nTarek","date":"2011-09-21 20:53:19"}],"3f3e1a7e":[{"text":"Gute Idee, aber Beleuchtung nicht optimal. :(","date":"2011-07-24 20:54:03"}],"6a17efc0":[{"text":"Max aka MyXoToD:\r\nHAHA! That's great! Need to test it by myself next time :) That gif-link matched perfectly :D","date":"2013-04-11 11:18:02"}],"62f53ec0":[{"text":"Ergo Proxy\r\nhttp:\/\/youtu.be\/jb3_pt4woi8 (trailer)\r\n&gt; 23 Folgen, je 25min\r\nDystopisches, düsteres Setting, Genre: Mystery\/Sci-Fi\/Psychological. Gute Charaktere, gute Story.\r\n\r\nShinsekai Yori (&quot;Von der neuen Welt&quot;)\r\nhttp:\/\/www.nicovideo.jp\/watch\/sm18312927 (trailer, beim player unten auf die menüleiste mit dem &quot;...&quot; klicken, damit die 'on screen kommentare' weg bleiben)\r\n&gt; 25 Folgen, je 22min\r\nMenschen Entwickeln um die heutige Zeit plötzlich telekinetische Kräfte, Geschichte spielt 1000 Jahre in der Zukunft. &quot;Vehikel&quot; um die dortige Gesellschaft darzustellen sind eine Hand voll Freunde, deren Kindes-, Jugend- und Erwachsenenalter (jeweils Zeitsprünge) dargestellt wird. Entstehung der Gesellschaft, wie sie dort, besteht wird leider nur sehr wenig und indirekt behandelt. Qualität der technischen Umsetzung (Animation, Zeichnung) ist leider nicht super hochwertig. Story\/Setting sind aber schon ganz interessant. Ist jetzt nicht herausragend aber ... ganz gut.\r\n\r\nKino no Tabi (&quot;Kinos Reise&quot;)\r\nhttp:\/\/youtu.be\/yEaycSzHQpU (mäßiger fanmade trailer)\r\n&gt; 13 Folgen, je 24min\r\nEin Mädel, &quot;Kino&quot;, reist auf seinem Motorrad durch eine fiktive Welt von einem &quot;Land&quot; (eher die Größe einer Standt) zum nächsten. Die &quot;Länder&quot; haben jeweils immer eine Eigenart, die ein ethisches\/philosophisches Problem aufzeigt. In einem Land wurde z.B. vor einiger Zeit etwas entwickelt, das bewirkt, dass jeder die Gedanken der anderen lesen kann — vollkommene Offenheit. Als Folge daraus leben die Menschen dort nun alle für sich allein, in Angst vor anderen Menschen.\r\n\r\nBakemonogatari (&quot;Geistergeschichte&quot;)\r\nhttp:\/\/youtu.be\/X63_YYZjKxA (trailer)\r\nhttp:\/\/youtu.be\/v8kIJbHANgs (trailer zu nem sequel)\r\n&gt; 15 Folgen, je 24min\r\n&quot;'Bakemonogatari', cleverly translated as 'Ghostory' or 'Monstory', is about five not-so-normal girls that Araragi Koyomi, a vampire himself, encounters and attempt to save from oddities possessing them.&quot;\r\nIm Endeffekt sind das Setting und die Story (mit denen nichts verkehrt ist) aber absolut nicht, was die Serie ausmacht. Interessant ist eher die Präsentation. Viele gekonnte Spielereien mit Perspektive, Cut, ... lauter so film-technische Sachen — bin kein Experte. Oft passiert an sich ziemlich wenig, aber ausgiebige Dialoge und klasse Charaktere unterhalten mehr als genug. Plus wie gesagt ausergewöhnliche Präsentation.\r\n\r\nSteins;Gate\r\nhttp:\/\/youtu.be\/LwcTi86cFeg (fanmade trailer)\r\n&gt; 24 Folgen, je 24min\r\nSuper unrealistisches Setting (verquerer Typ, der sich selbst als einen &quot;mad scientist&quot; bezeichnet, baut seine Mikrowelle um, sodass er per Handy Nachrichten in die Vergangenheit schicken kann). Die Story, die sich entwickelt, gibt allerdings wirklich was her.\r\n\r\nOokami to Koushinryou (&quot;Wolf und Gewürze&quot;)\r\nhttp:\/\/youtu.be\/MN_WgwEmRaw (intro sequenz)\r\n&gt; 13 Folgen, je 24min\r\nEinfacher Händler in mittelalterlichem Setting trifft auf eine Wolfsgöttin in Menschengestalt, die ihn fortan auf seinen Reisen begleitet. Super ruhige Atmoshäre, wunderschöner Soundtrack, seichte Story und viele nette Parts, in denen es um den Handel an sich geht — also Spekulationen auf Preise, Optionen (https:\/\/de.wikipedia.org\/wiki\/Option_%28Wirtschaft%29), usw.\r\n\r\nNichijou (&quot;Alltag&quot;)\r\nhttp:\/\/youtu.be\/cTqBqySBlY0 (szene aus folge 1)\r\n&gt; 26 Folgen, je 23min\r\n&quot;Alltag&quot; dreier Schülerinnen. Aber eigentlich nur eine Aneinanderreihungvon Übertreibungen, Gags, Nonsens, usw. Kann man durchaus sehr lustig finden.\r\n\r\nChihayafuru (lässt sich nicht so einfach übersetzen: https:\/\/en.wikipedia.org\/wiki\/Makurakotoba)\r\n&gt; 25 Folgen, je 22min\r\nhttp:\/\/akross.ru\/index.cgi?act=video;id=3456;l=e (fan-video)\r\nGeht um ein Mädel, das von &quot;Karuta&quot; (http:\/\/www.asahi-net.or.jp\/~xs3d-bull\/essays\/karuta\/karuta.html), einem Japanischen Kartelspiel\/Sport, total besessen ist, einen Karuta-Club gründet, Turniere bestreitet usw. Ist dadurch im Endeffekt ein Sport-Anime.\r\n\r\nShingeki no Kyojin (&quot;Vorstoß\/Angriff der Titanen&quot;)\r\nhttp:\/\/youtu.be\/yOPNwLSKZSE (guter fanmade trailer)\r\n&gt; 25 Folgen, je 24min\r\nMenschen leben in einer Stadt mit riesigen Mauern, da außerhalb Titanen rumlaufen, die Menschen fressen (keiner Weiß wirklich wo die herkommen). Hauptcharakter verliert seine Mutter durch Titanen und schwört sich, Rache zu nehmen.\r\nGute Action, ein paar riiichtig gute &quot;Twists&quot; (wenn man es so nennen mag), leider hat die Story zwischendrin mal nen ziemlichen Durchhänger und erholt sich auch nicht undbedingt wieder vollständig davon. Aber insgesamt schon cool das Ganze.\r\n\r\nSword Art Online\r\nhttp:\/\/youtu.be\/szoyfP_Wfx8 (trailer)\r\n&gt; 25 Folgen, je 23min\r\nVirtual Reality MMO wird entwickelt, riesen Hype vor dem Release, entsprechend viele Spieler bei Release direkt im Game. Twist: man kann sich nicht ausloggen und wer im Spiel stirbt, dem grillt der VR-Helm im echten Leben das Hirn (Folge 1 gespoilert, sorry ^^). Geschichte dreht sich um einen recht begaben Spieler, der gut abgeht — standard Action-Serie. Allerdings wirklich guter Sound mMn und schöne Rage-Action-Übertreib-Momente.\r\n","date":"2014-07-04 20:24:37"}]}