{"92549a14":[{"text":"As far as I know, you can move clients between displays using Mod4 + o (using awful.client.movetoscreen).\r\nI myself have a TwinView setup, so I can't say if this works with XRandR (it should, however).\r\n~ Wolfgang","date":"2012-05-22 20:49:23"},{"text":"Works perfectly. : ) Thanks for pointing that out. If I just had carefully read through the man page of awesome instead of trying to find a solution via Google. ^^","date":"2012-05-22 20:49:45"}],"317f2497":[{"text":"Freut mich, dass sich noch jemand für awesome begeistern kann. Habs schon seit knapp 5 Monaten und will nicht mehr zurück.\r\nemelFM2 muss ich gleich mal ausprobieren. Setze bis jetzt immer noch auf vim mit NERDTree. - Wolfgang","date":"2011-12-26 20:51:11"},{"text":"Wow, NERDTree ist auch schick — das bleibt drauf. :D\r\n\r\nWas grafische Filemanager angeht hatte ich erst qtfm, fand's den aber nicht so toll und bin dann eben zu emelFM2 gewechselt. Schick find ich bei dem, dass man unten immer ne Konsole mit dran hat. Konfigurationsmöglichkeiten scheinen auch zu passen.\r\nNya, bin noch immer am Ausprobieren, Einrichten, Rumbasteln ... (nebenher, weil das Wichtigste schon alles läuft. ^^)\r\n\r\nDanke für den Kommentar. ; )","date":"2011-12-26 20:51:41"}],"ab2c19b1":[{"text":"I reckon the story stuff just appeared as you switched from german to english - change it back and enjoy your day ;)\r\n\r\ngreetings from sydney\r\nstefan (who just wanted to check whether you are listet on the waybackmachine ^_^)","date":"2011-09-21 20:53:02"},{"text":"Oh well ... since this ''incident'' happened like a month ago I'm now used to the story layout, so I won't change it at the cost of setting Facebook to German again. Sadly still 90% of all news items marked as top stories aren't really relevant to my interest or important by any means — I really wonder what Facebook is doing there.\r\n\r\nNice to hear from you btw. : )\r\nTarek","date":"2011-09-21 20:53:19"}],"3f3e1a7e":[{"text":"Gute Idee, aber Beleuchtung nicht optimal. :(","date":"2011-07-24 20:54:03"}]}
