[{"text":"<p>Soo ... 37 days, 104 kanji and 291 words later:<\/p>\r\n<br \/>\r\n<p>Not much to say about kanji learning itself. One thing would be, that due to an <a href=\\\"http:\/\/ankisrs.net\/docs\/changes.html#changes-in-2.0.13\\\">Anki update<\/a> that changed the handling of sibling cards my second daily Anki session now includes a bit more cards than before and the first session a bit less. Not much of a change.<\/p>\r\n<p>I still try to keep the number of reviews due on one day between 80 and 100 but ... as my <a href=\\\"img\/blog\/anki_stats_131109.png\\\">Anki stats<\/a> reveal, not always manage to do that.<\/p>\r\n<br \/>\r\n<p>Since there's nothing more to say about kanji learning, a quick note on grammar:<\/p>\r\n<p>As opposed to vocab, grammar isn't super easily quantified. No numbers, no charts ... Because of that I had a little bit of a problem to continue practicing and learning new grammar for a while.<\/p>\r\n<p>To deal with that I stated a <a href=\\\"http:\/\/moc.sirtetris.com\/grammar_rush\/\\\">\\\"grammar rush\\\"<\/a> (inspired by <a href=\\\"https:\/\/www.youtube.com\/watch?v=l-9H_vAx8-I#t=6m57s\\\">this YesJapan video<\/a>). Instead of really just flipping through a workbook and taking notes I read one chapter of <a href=\\\"http:\/\/www.guidetojapanese.org\/learn\/grammar\\\">Tae Kim's Grammar Guide<\/a> a day and post some example sentences using the new grammar on Lang-8. So far this works really well for me.<\/p>\r\n<br \/>\r\n<p>As always, for the sake of documentation, these are the kanji I know so far:<\/p>\r\n<p>一右雨円王音下火花貝学気休玉金九空月犬見五口校左三山四子糸字耳七車手十出女小上森人水正生青石赤先千川早足村大男竹中虫町天田土二日入年白八百文本名木目夕立力林六雲黄何夏家歌画会回海絵外楽間顔帰汽記弓牛魚京強教近兄形計元言古戸午後語工考行高合国黒今作姉市思止紙寺時自室社弱首秋週春書少場色食心新親図数星声西切前走多太体台知地朝長直弟点電冬刀東当答同読内南肉馬買売半父風分聞米歩母方北妹毎万明門夜矢友曜来理里話悪安暗意医員飲駅央屋化界開感漢館起急去業曲銀具軽仕使始死詩事持写者主取受終住重宿所申真神世全息速族待代第題短着注鉄転都豆動反美品部服物返勉味面問由遊洋羊葉陽両緑列和愛英果官泣訓欠結好最昨札殺散史氏辞失周初信静然争束達置的典徒働不付夫変便末未無約利料良例歴易可過句雑志質授術招常舌婦弁映干机貴敬警穴己孝私至詞誌尺若寸窓難枚訳亜越介吉詰更江項婚歳侍趣丈寝辛占替遅超斗彼又漫娘免与裸竜恋闇亀巾誰爪箸枕也亦巴頁帚勺<\/p>","id":"82d546f5","date":"2013-11-09","headline":"漢字 — 400+","image":"kanji_checkpoint_4.png"},{"text":"<p><a href=\\\"img\/blog\/keima_god_mode.png\\\" \/>God mode<\/a> activated. :)<\/p>\r\n<p>Exactly one month ago I wrote 「漢字 — 200+」 and since then addded 280 new words using 100 new kanji to my Anki deck. That means I learned more than nine words per day — which is pretty awesome compared to what I did before.<\/p>\r\n<p>Looking at my <a href=\\\"img\/blog\/anki_stats_131003.png\\\" \/>Anki stats<\/a>: I learned every day and added new vocab on 25 of 30 days. On average I review 115 cards in 52 minutes. I require additional time to find new kanji, create mnemonics, find useful new vocab using those kanji, etc. So I guess it's reasonable to assume that I spend about 1.5 hours a day on Japanese vocab. Doesn't sound like an awful lot of time and yet the benefit is quite awesome. :)<\/p>\r\n<br \/>\r\n<p>The most important thing to note is, that I really made it a habit to go through all due Anki cards in the morning\/early afternoon, add new kanji in the evening and go through these a bit later. If you're used to it, it's no burden.<\/p>\r\n<p>Further changes in my learning approach: I use <a href=\\\"http:\/\/www.tagaini.net\/\\\">Tagaini Jisho<\/a> <em>a lot<\/em> more than before. And I more often use word frequency lists to find new useful vocab. Apart from that ... I sometimes find it useful to not sit in from of my computer with all its distractions when learning, so I use AnkiWeb on my Kindle which works fine.<\/p>\r\n<br \/>\r\n<p>As always, for the sake of documentation, these are the kanji I know so far:<\/p>\r\n<p>一右雨円王音下火花貝学気休玉金九空月犬見五口校左三山四子糸字耳七車十出女小上森人水正生青赤先千川早村大男中虫町天田土二日入年白八百文本名木目夕立力六雲何夏家会回海外楽間顔汽記弓牛魚強近兄計元言古戸午語工考行高国黒今作姉市思止寺時自室社弱首秋週春書少場色食心新親星声西切前多太体台知朝長直弟電冬刀東当読内南肉買売半父風分聞米歩母方北妹毎万明門矢友曜来里話悪安暗意員飲央屋化界開漢急銀具軽仕使始死詩事持写者主取住重宿所申真神世全息族待題注転動品部物勉問由遊羊葉陽両緑和英果訓欠好昨札殺史周信静争達置的働不夫末未利良易雑質招常舌弁干机貴己私至詞誌尺若寸枚訳亜介吉詰江項歳侍丈寝遅彼又娘免与竜闇亀巾誰枕巴頁勺<\/p>\r\n\r\n","id":"51c3029e","date":"2013-10-03","headline":"漢字 — 300+","image":"kanji_checkpoint_3.png"},{"text":"<p>Strange thing about Amazon: Japanese books (offered on amazon.com and amazon.de) are <a href=\\\"img\/blog\/jp_kindle_0.jpg\\\">not available for the standard Kindle<\/a> although it's perfectly capable of displaying Japanese content. This applies to <em>all<\/em> books in Japanese. Which sucks. So contacted support concerning that matter ...<\/p>\r\n<br \/>\r\n<p>Fortunately there are alternatives: <a href=\\\"http:\/\/www.aozora.gr.jp\/\\\">青空文庫 (Aozora Bunko<\/a>) offers Japanese books for free and with <a href=\\\"http:\/\/a2k.aill.org\/\\\">青空キンドル (Aozora Kindle)<\/a> you can easily convert them to beautiful PDFs. :)<\/p>\r\n<p>To do that, take a book from 青空文庫 (for example <a href=\\\"http:\/\/www.aozora.gr.jp\/cards\/000311\/card2762.html\\\">this<\/a>), scroll down to the ファイルのダウンロード section and copy the URL to the zip file. In our example that's:<\/p>\r\n<pre>http:\/\/www.aozora.gr.jp\/cards\/000311\/files\/2762_ruby_8768.zip<\/pre>\r\n<p>Head to 青空キンドル, paste the URL, change settings if you want (I recommend setting the 文字 to 大), hit PDF化, copy the PDF file to your Kindle and you're done. :)<\/p>\r\n<p>Beautiful <a href=\\\"img\/blog\/jp_kindle_1.jpg\\\">Japanese<\/a> on your <a href=\\\"img\/blog\/jp_kindle_2.jpg\\\">Kindle<\/a>. What you may want to avoid, however, is using Japanese file names. They <a href=\\\"img\/blog\/jp_kindle_3.jpg\\\">won't be displayed as expected<\/a>, which I presume it's due to the FAT 32 file system.<\/p>","id":"662849f9","date":"2013-09-08","headline":"Japanese books for your Kindle","image":"jp_kindle.jpg"},{"text":"<p>Whew ... at last. Turns out a lot of free time doesn't seem to be the best thing for my learning efforts. I tend to approach other time consuming stuff that wouldn't be possible alongside lectures and end up having a hard time keeping up with making progress with my Japanese. D:<\/p>\r\n<br \/>\r\n<p>Looking at my <a href=\\\"img\/blog\/anki_stats_130903.png\\\" \/>Anki stats<\/a> for the last month: the mostly hidden larger gap responsible for that first huge bar was a 5 day trip to Munic for a parkour jam, next gap was a spontaneous programming project iirc (something that doesn't show up in my Google calendar at least) and the third gap was Ludum Dare 27, a video game development competition.<\/p>\r\n<br \/>\r\n<p>Anyway: what I'm experimenting with right now is different methods for choosing which kanji to learn next. For some time I sticked with the JLPT kanji listed <a href=\\\"http:\/\/tangorin.com\/common_kanji\\\">here<\/a>, but it seems to take me longer and longer to find good candidates. I consider switching to going through easy reading material online and adding stuff I don't know yet. Another option would be using some frequency list.<\/p>\r\n<br \/>\r\n<p>Apart from that everything's going well. Creating mnemonics is still fun. :) Oh and when learning with Anki I now write out readings in katakana instead of hiragana from time to time — helps preventing that I forget those bastards. :D<\/p>\r\n<br \/>\r\n<p>Again, for the sake of documentation, these are the kanji I know so far:<\/p>\r\n<p>一右雨円王音下火花貝学休玉金九空月犬見五口校左三山四子字耳七車十出女小上森人水正生先千川早村大男中虫町天田土二日入年白八百文本名木目夕立力六何会回外間牛魚近兄計言古午語工行高国黒今姉市思止寺時自室社首週書少場食心新星前多体知朝長刀読内肉買売半父風分聞米母方妹毎万明門矢友曜来里話安暗員央化急軽仕使死詩事主取住重申神動物問由遊羊英訓好昨札史周信達置働不夫末未良易雑常舌貴私至詞誌寸吉詰侍丈寝彼又闇巾誰枕<\/p>\r\n\r\n","id":"6a66c49c","date":"2013-09-03","headline":"漢字 — 200+","image":"kanji_checkpoint_2.png"},{"date":"2013-06-18","headline":"漢字 — 100+","text":"<p>So, a mere 5% of Jōyō kanji made their way into my head — and it's been fun so far, A LOT actually! :O<\/p>\r\n<br \/>\r\n<p>I can't really say why exactly, but I guess first off because as I continue learning kanji I'm able to read more and more Japanese stuff and also because I can play around with mnemonics. :3<\/p>\r\n<p>When I wrote about taking Japanese courses in my last post I was totally hyped. But in no way was I ready to get into kanji. I did a lot of preparation because the task seemed (and still seems) huge and I wanted to approach it in the best way possible.<\/p>\r\n<p>I thought about learning the 214 radicals before looking at a single kanji, I looked at guides like TextFugu and WaniKani and started hoarding useful resources like <a href=\\\"http:\/\/www.csse.monash.edu.au\/~jwb\/cgi-bin\/wwwjdic.cgi?1R\\\">Jim Breen's Multi-Radical Selection<\/a> ...<\/p>\r\n<br \/>\r\n<p>... after about a month I knew how I would do it: TextFugu and the like present a great method for learning kanji effectively, but there are two problems. Frist they focus on kanji only and don't present them in context, as compounds (afaik). Second and most imporantly, they use given mnemonics. No way in hell does it make sense to use other people's associations to remember stuff. If 肉 for me consists of a large gripper and two people which reminds me of Soylent Green and makes it super easy to remember then why should I try to remember it any other way?<\/p>\r\n<p>The thing with the official radicals is that sometimes they don't make sense to me, and for a lot of graphemes of given kanji there are no radicals. I cannot remember 刂 as a mere variation of 刀 — they need very distinct mnemonic names\/meanings or I'll mix them up.<\/p>\r\n<br \/>\r\n<p>So ... learning kanji for me works like this: I search for kanji made up of parts I already introduced to my mnemonic system that I'll use in sentences a lot. If I find no good candidates, I search for new graphemes\/parts that will \\\"enable\\\" useful new kanji. As a new useful kanji is found I try to find at least two ways to use it in sentences — one where a kun reading is used and one where an on reading is used. Super easy example: I know 田 and 力, now I find 男, super easy to remember and with 男の子 and 男子 I already have two readings involved. 男 with it's readings, meanings and a mnemonic wind up in a json file from which I generate a wep page displaying all my kanji with memonics and their parts\/graphemes linked for ease of use. 男の子 and 男子 are fresh input for my kanji deck in <a href=\\\"http:\/\/ankisrs.net\/\\\">Anki<\/a>. In the following days I then try to use 男の子 and 男子 in homework for my Japanese courses and in journals on <a href=\\\"http:\/\/lang-8.com\/\\\">Lang-8<\/a>. And that's how it goes. :) Works really well so far and is a lot of fun. Coming up with good memonics and the populating of previously mentioned json file can be a bit tedious though. ^^<\/p>\r\n<br \/>\r\n<p>For the sake of documentation, these are the kanji I know so far:<\/p>\r\n<p>一右円下火貝学金九空月犬見五口左三山四子字耳七車十女小上森人水生先千川大男中田土二日年白八百本名木目夕力六何回間計言語工行黒今思寺時自首少食心前多知読肉買風聞万明門矢曜里安央軽詩由好昨札置良雑常私誌寸詰侍寝彼又巾誰<\/p>\r\n<br \/>\r\n<p>And here are my current <a href=\\\"img\/blog\/anki_stats_130618.png\\\" \/>Anki stats<\/a> (deck created 2013-05-21).<\/p>\r\n<br \/>\r\n<p>I plan to do this kind of review every 100 kanji, so there will — hopefully — be a total of 21 of these in the end. Beginning with the second one they'll very likely be notably shorter. ^^<\/p>\r\n<br \/>\r\n<p>And that's it. Learning kanji is now part of my [ladder to the sun][triceratops with a cap cleaning his mouth with a napkin] life. :3<\/p>","image":"kanji_checkpoint_1.png","id":"e61bc488"},{"date":"2013-04-19","headline":"日本語 — at last some serious progress :3","text":"<p>I started taking beginner level Japanese courses at uni. The general path to learning the language and regular practice it provides seems to be exactly what was necessary to get me going. My learning efforts — til then not more than learning kana, remembering overused phrases from anime and then stagnating for like ... a year? I don't even know — suddenly skyrocketed and I now have to almost force myself to invest time into all the other stuff I have to do. You know ... my actual field of study and all that. ;P<\/p>\r\n<p>Anyway, Japanese, besides being listed as one of my interests, is now also a <a href=\\\"?c=projects\\\">project<\/a>. And btw.: <a href=\\\"http:\/\/lang-8.com\/\\\">Lang-8<\/a> is awesome!<\/p>","image":"jp_prj.jpg","id":"72ecfbb4"},{"date":"2013-04-08","headline":"CLI Love, Speedcubing, Half-Life, etc.","text":"<p>Got some stuff that I could have mentioned ... so: combo post!<\/p><br \/>\r\n<p><strong>CLI Love<\/strong><\/p>\r\n<p>I took some time to test some alternatives to the software I use on a daily basis. I dropped the window manager <a href=\\\"http:\/\/awesome.naquadah.org\/\\\">awesome<\/a> for <a href=\\\"https:\/\/opensource.conformal.com\/wiki\/spectrwm\\\">spectrwm<\/a> — a lot less crappy configuration, even more minimalistic and quite another approach to multi screen handling (still have to fully get used to it, but seems usable).<\/p>\r\n<p>Furthermore I switched from <a href=\\\"http:\/\/wiki.lxde.org\/en\/PCManFM\\\">PCManFM<\/a> to <a href=\\\"http:\/\/ranger.nongnu.org\/\\\">ranger<\/a> ♥ and finally moved on from <a href=\\\"http:\/\/www.videolan.org\/\\\">VLC media player<\/a> to <a href=\\\"http:\/\/mpd.wikia.com\/\\\">mpd<\/a> + <a href=\\\"http:\/\/freecode.com\/projects\/ncmpc\\\">ncmpc<\/a> for music and <a href=\\\"http:\/\/smplayer.sourceforge.net\/\\\">SMPlayer<\/a> for video matters.<\/p><br \/>\r\n<p><strong>Speedcubing<\/strong><\/p>\r\n<p>I attended a speedcubing competition ... just for fun. Now I have this fancy page with official results at the <a href=\\\"http:\/\/www.worldcubeassociation.org\/results\/p.php?i=2013SAIE02\\\">World Cube Association<\/a>. I'm pretty happy with the results as my times really are that inconsistent and I got rather nervous when it got official. I can do sub 30s, but that's only lucky exceptions.<\/p><br \/>\r\n<p><strong>Half-Life<\/strong><\/p>\r\n<p>I wondered how long it would take me to play through Half-Life, so I gave it a shot:<\/p>\r\n\".youtubedd(\"and recorded the hole thing\", \"LuvLcz67zYM\").\"<br \/>\r\n<p><strong>.XCompose kana input<\/strong><\/p>\r\n<p>I extended my <a href=\\\"https:\/\/raw.github.com\/IllDepence\/dotfiles\/master\/.XCompose\\\">.XCompose<\/a> file to now also support katakana instead of hiragana only and added some punctuation that was still missing.<\/p><br \/>\r\n<p><strong>Poral chibi portrait<\/strong><\/p>\r\n<p>Alisa created this awesome Portal themed chibi portrait of me that's now accompanying this blog post. :3 Here's her <a href=\\\"http:\/\/sakubik.com\/\\\">website<\/a> — read the \\\"very soon\\\" in a vaporware-ish \\\"when it's done\\\" kind of way. :D<\/p>","image":"cli_cube_hl.jpg","id":"e4ffeebd"},{"date":"2013-02-04","headline":"Deutsche Bahn ticket machines - hidden buttons","text":"<p>A few weeks ago I noticed something strange about the ticket machines of <a href=\\\"http:\/\/www.bahn.com\\\">Deutsche Bahn<\/a>. Normally, if you miss to hit a button, a red dot on the touch screen indicates where your \\\"click\\\" was recognized. But when viewing the <em>Verkehrsverbund<\/em>* section and \\\"missing\\\" on certain spots on the upper left and upper right corner of the screen, you saw an hourglass cursor for a short moment.<\/p>\r\n<p>Being in curiosity mode I had to <a href=\\\"img\/blog\/f5.gif\\\">test<\/a> if I could provoke a feedback of some kind. And in fact, rarely the screen was like flashing as I was rapidly clicking on both spots simultaneously.<\/p>\r\n<p>After playing around a bit more I found out that there are two \\\"four click combinations\\\" that will bring up a screen with some information: left, left, right, right gives you the application and system version; left, left, right, left a hole bunch more version data, the location of the machine and whatnot.<\/p>\r\n<p>At the point where I had found the first working combination and began trying out others I kind of felt like in a good old point and click adventure. :D Thanks for the entertainment, Deutsche Bahn. ^^<\/p>\r\n<br \/>\r\n<p>Here's a video of each of the screens:<\/p>\r\n\".youtubedd(\"left, left, right, right\", \"4mojRnjDJBI\").\"\r\n\".youtubedd(\"left, left, right, left\", \"H15ou4VdmCY\").\"\r\n<br \/>\r\n<p>*An association of public transport authorities.<\/p>","image":"bahn.jpg","id":"6a17efc0"},{"date":"2012-10-14","headline":"Site update","text":"<p><a href=\\\"?a=dc18fc96\\\">The renovation cat<\/a> must have sent it's friend. &mdash; I used the last two days to update the site a bit.<\/p>\r\n<br \/>\r\n<p>Blog section is now full width, manually chosen permalinks have been replaced by hashes, content has been restructured, the design changed a bit, spam protection is now done with reCAPTCHA, etc.<\/p>\r\n<p>Future plans are to build the site so that it functions perfectly fine w\/o JavaScript but, when enabled, makes good use of its benefits, heavily extend the interests section as implied there, etc. However, I guess it's going to take a while until I really find the time to make noticable changes again. I have a lot less free time than I'm used to atm and that's not going to change until February or so. :\/<\/p>","image":"renovation2.jpg","id":"a0f80ae1"},{"date":"2012-09-16","headline":"Making use of caps lock.&emsp;...&emsp;No, seriously.","image":"coolcaps.jpg","text":"<p>It is true. No longer will caps lock be the key that you accidentally hit an then hate for what it's doing.<\/p><br \/><p>So what is this about? A while ago I read about that fantastic idea of making the caps lock key behave like escape on <a href=\\\"http:\/\/www.kindofautomatic.de\/newblog\/?a=0db0b24f7\\\">Wolfgang's blog<\/a>. Which is really an awesome thing, especially for vim users.<\/p><p>But we don't want to eliminate caps lock. We want to make use of it. So: I recently switched from a German keyboard layout to a standard US one. Quite soon I realized, that I woudn't mind writing umlauts (&auml;&ouml;&uuml;) as ae, oe, ue but I'd really miss the s z ligature &szlig;.<\/p><p>It then occured to me (i.e. after wining about it on irc someone reminded me) that I could use compose. Which I, till then, only used for my beloved dash (&mdash;).<\/p><br \/><p>But something was bothering me: while the origins of the &szlig; are a bit complicated (the story includes the <a href=\\\"http:\/\/graphemica.com\/%C5%BF\\\">long s<\/a> (&#383;), a character that isn't used anymore, and there were different versions of the ligature using either the z or the s) and German speaking countries that don't use the &szlig;, like Swizerlad, use <em>ss<\/em> instead, it's present name <em>Eszett<\/em> (naming the letters <em>s<\/em> and <em>z<\/em>) and things like the HTML entity being &amp;szlig; (s z ligature) make the &szlig; &mdash; for me at least &mdash; more a ligature of s and z than of s and s. Yet, the default compose sequence for &szlig; is ss. I had to change that.<\/p><br \/><p>While creating my own <a href=\\\"https:\/\/wiki.archlinux.org\/index.php\/Accents_on_US_keyboards#Key_combinations\\\">.XCompose<\/a> file I had the idea to create compose sequences for <a href=\\\"http:\/\/en.wikipedia.org\/wiki\/Hiragana\\\">hiragana<\/a> (the reason why that's useful to me is a whole other story). But what would I use? &lt;Multi_key&gt; &lt;a&gt; for &#12354;, &lt;Multi_key&gt; &lt;n&gt; &lt;o&gt; for &#12398;, etc.? Would be quite annoying to be forced to hit the compose key (mapped to the <a href=\\\"http:\/\/en.wikipedia.org\/wiki\/Menu_key\\\">menu key<\/a> in my case) for each and every hiragana. There had to be a better solution.<\/p><p>I looked into <a href=\\\"https:\/\/wiki.archlinux.org\/index.php\/Input_Japanese_using_uim\\\">different input methods for Japanese<\/a>, but aside from the fact, that they'd clearly be more sophisticated than what I'd come up with (due to me only having <em>really<\/em> basic knowledge of Japanese), they weren't really what I wanted to have.<\/p><p>I then thought about a separate .XCompose file for hiragana that simply woud map a to &#12354;, n followed by o to &#12398; etc. and which I could load using some key combination. Turns out you can't change your .XCompose file on the fly. You have to restart X. :\/ (At least I found no way to do it.)<\/p><br \/><p>After a while of thinking and testing I had the idea to use a modifier for my hiragana compose sequences. More specifically: a modifier that can be toggled on and of: <strong>CAPSLOCK!<\/strong><\/p><p>What this means is, that for example a gets \\\"composed\\\" to &#12354;, but only when the modifier is active. The cool thing about that is, that you even have an LED indicator for which \\\"input mode\\\" your in. LED off = romaji, LED on = hiragana. This of course can be used for anything. Instead of a hiragana mode you could have a writing upside down mode, a Greek mode, etc.<\/p><br \/><p>If you want to try it out, here's my current <a href=\\\"src\/dl\/.Xmodmap\\\">.Xmodmap<\/a> (swaps escape and caps lock and set's compose to the menu key) and here's my <a href=\\\"src\/dl\/.XCompose\\\">.XCompose<\/a> file.<\/p>","id":"079cf21f"},{"date":"2012-08-14","headline":"Raspberry Pi + Lego Case :3","image":"rpi.jpg","text":"<p>Maybe not that interesting, but I felt like this had to appear here. I got my RPi in July and recently started to build a Lego case for it. The one you see on the picture (<a href=\\\"img\/blog\/rpi0.jpg\\\">fullsize<\/a>) was initially just \\\"find as much red parts as possible and use the other colors to create a prototype\\\".<\/p><p>After a while I started to replace strange colors (brown, green, pink, etc.) and black as well as grey bricks in my prototype with similar parts in blue, white or yellow. What you see is how far I got ... a few flat parts and a bigger \\\"window\\\" for the LEDs are still to be found. The completely red version is far from complete. I'd need 9 1x1 flat bricks with a flat surface on the top &mdash; not sure if we have that much.<\/p><br \/><p>Anyway &mdash; the Pi is up and running, serving mostly as an IRC client at the moment; guess it'll have the honor to take care of one or the orther cronjob in the near future and offer some web based \\\"services\\\" for me.<\/p><br \/><p>Miscellaneous information: I got the idea to build a Lego case from <a href=\\\"http:\/\/www.raspberrypi.org\/archives\/1354\\\">Biz's LEGO case<\/a>. I used pants for my case because they leave a bit more space inside. Everything located above a slot is fixed to the lid, so the Pi can be taken out once the case is opened withough the need to take it apart. I noticed that my case might not leave enough space for an RCA plug but I don't plan to use it anyway. I use Arch Linux ARM. <a href=\\\"img\/blog\/rpi1.jpg\\\">Here<\/a>'s a picture of my Raspberry Pi next to a raspberry pie.<\/p>","id":"0b5c23be"},{"date":"2012-07-19","headline":"JSONProxy","image":"jsonproxy.jpg","text":"<p>Before I begin with what this is actually about, some words for those who aren't familiar with AniDB, MyAnimelist, XDCC-Bots or at least one of those:<\/p><p><a href=\\\"http:\/\/anidb.net\/\\\">AniDB<\/a> and <a href=\\\"http:\/\/myanimelist.net\/\\\">MyAnimelist<\/a> are both websites that let you create a list of anime titles. In the case of AniDB the focus lies on the anime episodes you have stored somewhere, MyAnimelist cares more about what episodes you saw.<\/p><p>XDCC bots are IRC bots that send you files on demand. They are a common distribution method for fansubbed anime and offer so called packlists, where the list all the files they offer.<\/p><br \/><p>Now to the real story: I'm a user of both AniDB and MyAnimelist, but I only maintain a list on the latter. I use AniDB of keeping up to date with newly released episodes of airing series. The problem is, that if you only want to see notifies for new releases of certain subgroups, you have to add episodes of the respective anime <em>from that subgroup<\/em> to your list. I, however, don't maintain a list on that site, so I'd get a ton of unnecessary notifies.<\/p><br \/><p>Now, since I get all my new episodes from XDCC bots I though I could make use of simply parsing their packlists, which was the first thing I did: write a <a href=\\\"http:\/\/tareksaier.square7.ch\/animu\/entries.json\\\">JSON file<\/a> with all neccessary info, a small PHP script to parse the packlist and a <a href=\\\"http:\/\/tareksaier.square7.ch\/animu\/\\\">minimalistic site<\/a> to display the output. With that I always had an up to date list of all released episodes of the series I watch <em>and only from the subgroup I want them from<\/em>.<\/p><p>The problem with that approach was, that I had to memorize the number of the last episode I saw for every of those anime. So I had to come up with something different. Since MyAnimelist always has the information on which episode of which anime I watched last it seemed natural to use that. Also, since I open the page with <a href=\\\"http:\/\/myanimelist.net\/animelist\/IllDepence\\\">my list<\/a> on it several times a day, it seemed to be a good idea to simply include the information about new episodes there.<\/p><br \/><p>So I wanted to write a userscript that should obtain the information from both my JSON file and the packlists, look at the site itself and, if there were any episodes released that I hadn't seen, inform me about that ... well, <em>same origin policy says no<\/em>. The userscript is written in JavaScript and common browsers won't let it perform an XMLHttpRequest for stuff stored on other servers than the one the site you are viewing when the script is executed is hosted on.<\/p><p>I had to find a workaround and I though of JSONP, a method where you create a new script tag in the head of the site with the remote thing you want to access as the src attribute of that tag. Problem is, that remote thing should be a string with a JavaScript method call, so that you actually can use what you got from the remote server. But I wanted to access packlists I had no control over. It then came to my mind, that I simply could write a PHP script that would access and parse the packlist and return a JSONP string &mdash; a JSONP proxy you could say. ^^ And then access this with my userscript.<\/p><br \/><p>This is what I ended up doning. :) My <a href=\\\"http:\/\/tareksaier.square7.ch\/animu\/jsonp.php\\\">JSONProxy<\/a> parses packlists based on my <a href=\\\"http:\/\/tareksaier.square7.ch\/animu\/entries.json\\\">listing<\/a> of urls, titles and subgroups and my <a href=\\\"http:\/\/tareksaier.bplaced.net\/notHP\/mab\/MALandBots.user.js\\\">userscript<\/a> (<a href=\\\"http:\/\/tareksaier.bplaced.net\/notHP\/mab\/mab.js\\\">actual code<\/a>) uses that to inform me about new episodes. :3<\/p><br \/><p>I guess it would be quite easy to write a universal JSONProxy which takes a get parameter (the url to the document one wants to access) and returns a JavaScript method call with the whole site as a parameter. What I'm not sure about is, wether or not there are regulations on the src attribute of script tags and how messy the escaping of whole websites for the JS method call would get. ^^<\/p><p>Oh and by the way: since the actual request to the site you do not control (in my case the packlists) is not performed by the browser the JS is running on but by the PHP script on your server this method doesn't even violate the same origin policy more than JSONP itself &mdash; it's just a handy way to access data from other servers when you write userscripts. :)<\/p>","id":"bc07419d"},{"date":"2012-06-14","headline":"VZ Netzwerke message backup","image":"vzmb.jpg","text":"<p>A few days ago I read that the <em>VZ Netzwerke<\/em> (a group of dying social networks once popular in Germany) will be renamed to or restarted as <em>idpool<\/em>. Reading about those networks alone reminded me that ever since I stopped using them I wanted to backup all my messages. Hearing that the platform will be undergoing serious change some time soon made me take immediate action.<\/p><br \/><p>I wrote a Perl script to extract the messages and store them in json-files. To view the messages I wrote a simple web interface in PHP.<\/p><p>I ran into some problems with SSL connections which is why the script uses a session ID instead of an e-mail address and password as a launch parameter. Additionally, when dealing with large amounts of messages the script decided to freeze after a certain amount of parsed messages, so I wrote a second version using threads to parse messages and in case they freeze simply parse the message again. This second version, however, is painfully slow because of my crappy implementation &mdash; but since it does a job that only has to be done once I'm fine with that. :D<\/p><br \/><p>Concerning the web interface one thing was very important for me: having messages and answers that belong together being displayed at the same place. A thing that the <em>VZ Netzwerke<\/em> never offered, you only have your in- and outbox. Separated. Absolutely terrible if you want to read an old conversation again. So ... my web interface shows all messages to and from a person at one place. : )<\/p><br \/><p>In case you'd like to backup your messages too, here you go: <a href=\\\"src\/dl\/vz_messageparser.tar.gz\\\">vz_messageparser.tar.gz<\/a><\/p><p>Run <span style='font-family: Monospace;'>perl vzmp.pl &lt;studi\/schueler\/mein&gt; &lt;sessid&gt;<\/span> (use vmzp_crap.pl in neccessary) and view the index.php (webserver required ofc) as soon as the script finished.<\/p><br \/><p>\".youtubedd(\"Here is a video showing how it works.\", \"Mm_LEnnp-mE\").\"<\/p>","id":"5672bf6f"},{"date":"2012-05-22","headline":"Impress Presenter Screen + awesome","image":"","text":"<p><strong>\/edit:<\/strong> modkey + o moves windows between displays &mdash; that pretty much solves the whole thing. Sometimes patiently reading though a man page solves your problems more efficiently than asking Google for help. (Thanks to <a href=\\\"http:\/\/www.kindofautomatic.de\/newblog\/\\\">Wolfgang<\/a> for informing me about the key binding.)<br \/><br \/><p>Getting LibreOffice Impress' extension <a href=\\\"http:\/\/www.archlinux.org\/packages\/extra\/x86_64\/libreoffice-extension-presenter-screen\/\\\">presenter-screen<\/a> (aka \\\"Presenter Console\\\") to work when using <a href=\\\"http:\/\/awesome.naquadah.org\/\\\">awesome<\/a> turned out to be a bit tricky.<\/p><p>So, if youre using awesome and want to use the extension, here's how it works:<\/p><br \/><p>Assuming you're using a laptop with a resolution of 1366x768 and present on a beamer, connected via VGA with a resolution of 1280x960. (Use xrandr to find out the actual output and resolutions.)<\/p><br \/><p><strong>1. Display setup<\/strong><\/p><p>Your own screen: xrandr --output LVDS --mode 1366x768 --primary<\/p><p>The beamer: xrandr --output VGA-0 --mode 1280x960 --right-of LVDS<\/p><br \/><p><strong>2. Impress<\/strong><\/p><p>Make sure the extension is recognized: Tools -> Extension Manager<\/p><p>Set the presentation display to \\\"Display 2\\\": Slide Show -> Slide Show Settings<\/p><p>Place the Imress window on the beamer display and start the presentation.<\/p><br \/><p>You should now see the presenter screen on top of your presentation's slides, both on the beamer display.<\/p> <br \/><p><strong>3. awesome<\/strong><\/p><p>With your cursor, hover over the presenter screen.<\/p><p>Press modkey + m (maximize window) <em>twice<\/em>.<\/p><p>Move the presenter screen to your laptop's display.<\/p><br \/><p>This all would be much easier if there was a key binding for moving (maximized) windows between displays, not only tags. I'm not aware of one.<\/p>","id":"92549a14"},{"date":"2012-04-07","headline":"Time-lapse photography for less than 2&dollar;","image":"irremote.jpg","text":"<p>A few weeks ago I thought it would be nice to try out time-lapse photography. I searched for ways to trigger my DSLR in given inverals and found, that the plug for wired remotes was some proprietary Nikon thing and timer remotes cost 40&euro; upwards.<\/p><br \/><p>Fortunately, DSLRs can also be triggered using an infrared signal. I already owned an Nikon ML-L3, a normal IR remote compatible to my Nikon D80. So what I did (and what you can also do to have fun with IR devices) was <a href=\\\"img\/blog\/irremote_tldr.jpg\\\"><strong>this<\/strong><\/a>.<\/p><br \/><p>Simply connect an IR LED to an audio cable and use it to record and send IR signals. It's that easy. : )<\/p><br \/><br \/><p>If you're interested in further information on this topic have a look at the following links:<br \/><a href=\\\"http:\/\/photocreations.ca\/nikon_d70s\/index.html\\\">Jim Watters - Nikon D70s MC-DC1 remote<\/a><br \/><a href=\\\"http:\/\/www.doc-diy.net\/photo\/remote_pinout\/\\\">www.doc-diy.net :: camera remote release pinout list<\/a><br \/><a href=\\\"http:\/\/www.instructables.com\/id\/DIY-Infrared-transmitter-for-iPhone-iPod\/\\\">DIY Infrared transmitter for iPhone, iPod<\/a><br \/><a href=\\\"http:\/\/luckylarry.co.uk\/arduino-projects\/arduino-ir-remote-intervalometer-for-nikon-d80-that-means-timelapse-photography-yarrr\/\\\">Arduino – IR remote\/ intervalometer for Nikon D80 DSLR (that means timelapse photography yarrr!)<\/a><br \/><a href=\\\"http:\/\/www.bigmike.it\/ircontrol\/\\\">bigmike.it - infrared remote control for Nikon<\/a><\/p>","id":"d9000c79"},{"date":"2012-03-30","headline":"Grid scroll","image":"gridscroll.jpg","text":"<p>Added a \\\"scrolling\\\" fuctionality to the grid in the <a href=\\\"?c=photography\\\">photography section<\/a> &mdash; should now be at least a bit more comfortable to browse through. Writing it, however, wasn't that much of a pleasure. :D First of all things tend to end up pretty messy whenever I work on stuff \\\"combining\\\" PHP and JS. On top of that the \\\"math\\\" behind the shifting of my images went fully out of control. Loops and lists functioning in opposite directions, +1 here, -2 there &mdash; oh well ... somehow it's working now. :D<\/p>","id":"5827bf62"},{"date":"2012-02-21","headline":"On the subject of nice frames","image":"frames.jpg","text":"<p>A few days ago I made a new acquaintance &mdash; interesting personality, joyful charakter; the kind of person you're grateful to have met. The following days I was really keen on further communication &mdash; text based due to distance, which, on a side note, actually isn't a bad thing at all. Talking seems to be the right thing to do in order to share experiences, writing appears to be predestined for getting to know someone's wolrd of thought. Anyway: communication at first went fine, but after a while I had the feeling my conversational partner lost interest. The atmosphere kind of infected me and I got all gloomy and listless. This really annoyed me and I tried to find a way out of my bad mood. I thought about what the situation was, what I wanted it to be or how I could view it from a different perspective so that it looked all good again. And then it struck me: <em>\\\"Hey ... you're talking to an interesting person. Most people, when you give them some kind of input, come out with some average ouput you won't really consider to be interesting. Here you got someone that, given input, grants you valuable, interesting ouput in exchange. Why don't you simply ask whether or not there's still interest in further communication, whether or not you're annoying\/uninteresting? If there's still interest and you're not annoying: go ahead and enjoy this rare personality you consider yourself fortunate having become acquainted with.\\\"<\/em><\/p><p>All of a sudden my mood turned from pretty down to fully enthusiastic again. : )<\/p><p>All I did was to take the present situation and put it in a nice frame so that it looked pleasant and motivating again. What I did in the first place was <em>assuming<\/em> that there was something wrong with the situation. What I did to fix it was to realize that I only know my own situation, which actually is fortunate, and that I should ask whether or not the situation of my communicational partner is as it seems to me. As it turned out later my first assumption was completely wrong and I was \\\"allowed\\\" to continue being curious and carry on the conversation. :3<\/p><p>I also realized that I had done this (putting something in a nice frame) before, however I hadn't observed myself and concentrated on what I was doing back then. Anyway: it seems to be a nice technique to handle unpleasant situations: take what you got, consider that you might have made a mistake in the way you currently view the situation, try to fix those mistakes and thus put things in a nice frame. : )<\/p>","id":"a54a924d"},{"date":"2012-02-17","headline":"Movielist changes + service","text":"<p>The <a href=\\\"?a=132c1dbb\\\">first implementation<\/a> of my movielist made use of IMDBPHP, a third party API thingy. I now finally got rid of it and wrote my own code. Not that IMDBPHP would have been bad in any way, it just was way to heavyweight for what I used it for. Additionally I created a little HTTP <a href=\\\"?c=service\\\">service<\/a> which can be fed with an IMDb ID and a specification of information type via GET parameters to receive a plain text answer.<\/p><p>Since both the service and parts of the movielist use fsockopen() &mdash; which is disabled on bplaced.net &mdash; I have to host them on square7.ch.<\/p><p>Besides: Vim syntax highlighting (with background set to dark) is just sexy. &lt;3<\/p>","image":"imdbinfo.jpg","id":"bb8af8c0"},{"date":"2012-01-24","headline":"Kill process by name (or: what pkill already does)","image":"","text":"<p>Whenever I wanted to terminate a program by fore I used <em>ps -A | grep PROGNAME<\/em>, read the process id and then executed <em>sudo kill PID<\/em>. Now I wrote a one line bash script making things easier &mdash; reducing the required effort by half:<\/p><br \/><p>&emsp;#!\/bin\/bash<br \/>&emsp;sudo kill `ps -A | grep &#36;1 | grep -Eo '[0-9]{3,4}'`<\/p><br \/><p>Also usable as a one line command which requires one to enter the program's name afterwards:<\/p><br \/><p>&emsp;read x;sudo kill `ps -A | grep &#36;x | grep -Eo '[0-9]{3,4}'`<\/p><br \/><p>The first version, however, is much more convenient. I stored it as <em>nkill<\/em> in \/usr\/bin\/ which enables me to for example kill firefox with <em>nkill firefox<\/em> or kill all open terminals with <em>nkill xterm<\/em>.<\/p> <br \/><p><strong>Update:<\/strong> Uhm ... yeah ... I just learned that pkill does <em>just that<\/em>. :D<\/p>","id":"4a502a4b"},{"date":"2012-01-17","headline":"Proper subsequent loading of content","image":"elcbjs.jpg","text":"<p>On today's schedule:<br \/> light exercises in JavaScript, regular expressions and Vim. :D<\/p><br \/><p>I finally managed to grant my <a href=\\\"?c=el\\\">Elfen Lied content base<\/a> a proper functionality to load content on demand. The full page contains images worth >60MB. Combined with slow speed due to free webspace you end up with a browsing experience of pure <em>\\\"meh ...\\\"<\/em>. Until now I only hid collapsed content and displayed it on demand. Now expanding and collapsing really means loading the content and removing it. Not only hiding and displaying while loading it anyway.<\/p>","id":"b6edd160"},{"date":"2011-12-26","headline":"Arch and Wacom","image":"arch.jpg","text":"<p>Arch Linux! Wacom! W00t! &lt;3 :D<\/p><br \/><p>Okay ... one thing at a time ... After a good year of using Ubuntu I now switched to <a href=\\\"http:\/\/www.archlinux.org\\\">Arch Linux<\/a>. The reason being that I'll be forced to build a system fitting to my needs.<\/p><p>Thanks to the great beginner's guide on archlinux.org I managed to set up a basic system pretty fast and I didn't even run into that much problems. ^^ At the moment I'm using awesome as a window manager &mdash; which, btw, is absolutely doing justice to its name &mdash;, emelFM2 as my filemanager (also a great component), sxiv for viewing images and apart from that the common stuff that I already used before ... Firefox, VLC, GIMP, XAMPP, etc.<\/p><br \/><p>The thing that caused the most problems so far and, additionally, the second topic in this blog entry, is my new Wacom Bamoo Pen tablet. I chose a Wacom tablet because I knew about the <a href=\\\"http:\/\/sourceforge.net\/apps\/mediawiki\/linuxwacom\\\">Linux Wacom Project<\/a>. Unfortunately the tablet I got is a relatively new model and isn't yet supported by the standard linuxwacom package you get from the repositories. Thus I had to use a package from the AUR, patch it and manually change some stuff &mdash; which I managed to do because of the great help I got from some guys from #archlinux.de. : )<\/p><br \/><p>So ... I now got a new, awesome system and a nice drawing tablet. The only thing I'm missing now is drawing skills. :D But that's fine, I got the tablet mainly for postprocessing of photos and doing stupid things on imageboards. ^^<\/p>","id":"317f2497"},{"date":"2011-12-20","headline":"Link Pixel Cookies!","image":"lpc_prev.jpg","text":"<p><br \/>*Le having friend that is huge fan of Zelda franchise<br \/><br \/>wild <a href=\\\"http:\/\/youtu.be\/hqMXtNX3KrI\\\">YouTube video<\/a> appears<br \/><br \/>make <a href=\\\"img\/blog\/lpc.jpg\\\"><strong>this<\/strong><\/a><\/p>","id":"a0e249e1"},{"date":"2011-12-14","headline":"UML &mdash; and how to have fun with it","image":"uml.jpg","text":"<p>When you start learning UML and, at first, find it rather annoying and useless, gradually, however, become aware of its usefulness but during that process never stop dealing with it with a lot of humor, then you might end up using domain class diagrams just like <span id=\\\"trigger_troll\\\"><a onClick=\\\"dropdown('troll', '<img src=\\'img\/blog\/umltroll.gif\\' \/>', 'open', 'that')\\\" onMouseOver=\\\"this.style.cursor='pointer'\\\">that<\/a><\/span>.<\/p><span id=\\\"cmnt_troll\\\"><\/span>","id":"520da90d"},{"date":"2011-12-09","headline":"Catching up","image":"ketchup.jpg","text":"<p>Since my last blog post several things happened that I could have mentioned here, but I somehow never got around doing so. Therefore I'm now doing a chatch-up post:<\/p><br \/><h2>Parkour<\/h2><p>A day after I wrote the <em>\\\"Parkour \/ Freerunning \/ Movement\\\"<\/em>-post I attended the <a href=\\\"http:\/\/www.parkour-stuttgart.de\/training\/themenworkshop\\\">parkour theme workshop<\/a> by Parkour Stuttgart, which was a great experience. These workshops are organized every first saturday of each month. Anyone can attend and it's for free. Also worth mentioning: I got into some <a href=\\\"img\/blog\/doublekong.png\\\">serios double kong action<\/a> lately. ^^<\/p><br \/><h2>Mawaru Penguindrum<\/h2><p>If you happen to be a fan of <a href=\\\"http:\/\/penguindrum.jp\\\">Mawaru Penguindrum<\/a> these two things might be for you. First: I rebuilt the penguin head icon that members of KIGA group have on their shirts as a vector graphic. Here's a <a href=\\\"img\/blog\/mpd_makeoff.jpg\\\">making off<\/a> (I used <a href=\\\"http:\/\/inkscape.org\\\">Inkscape<\/a>). You can get the SVG file <a href=\\\"src\/dl\/pingu.svg\\\">here<\/a>. Second: if you'd like to browse through awesome Mawaru Penguindrum fanart take a look at what <a href=\\\"http:\/\/www.zerochan.net\/Mawaru+Penguindrum?p=1\\\">zerochan.net<\/a> has to offer. It's nothing but amazing. A four-digit count of really great pictues only on Mawaru Penguindrum. :O<\/p><br \/><h2>A first attempt in social engineering<\/h2><div class=\\\"imgfloatright\\\">\t<img src=\\\"img\/blog\/oxid.jpg\\\" \/>\t<div class=\\\"imgsrc\\\"><p><a href=\\\"img\/blog\/oxid.src\\\">source<\/a><\/p><\/div><\/div><p>On November 24th Furtwangen University (that's where I study) had a special day for exchange between companies and students. The companies have stands in the hallways and lecture rooms where they introduce themselves. Students walk around to gather information relevant for a practical semester or thesis and harvest giveaways, mostly pens. One of the companies present was <a href=\\\"http:\/\/www.oxid-esales.com\\\">OXID eSales<\/a>, they make online shops with PHP. The cool thing at their stand was, that they had t-shirts with PHP code (and their logo ofc) on them which they gave away for free. I quite like PHP, I had to get one of them, so did some of my fellow students. We continued our raid for pens ...<\/p><p>Then I realized something. The t-shirts that OXID gave away where exactly the same t-shits that their employees wore at their stand. I continued on that thought: people wearing such a shirt standing at their stand are thought to be OXID employees and they're asked questions about the company by students that walk by. I now possess such a shirt ...<\/p><p>By now you probably figured out what I was about to do. I asked one of my mates what he thought about temporarily becoming and OXID employee. He liked the idea, we put the t-shirts on and headed off to OXID. In the end the area around the stand wasn't quite crowded enough for the plan to succeed, but the OXID employees that spotted us \\\"supporting their team\\\" happened to find it amusing what we did. As you can see they even took a picture of us at their stand.<\/p><br \/><h2>iCTF<\/h2><p>At university we had a team that took part in <a href=\\\"http:\/\/ictf.cs.ucsb.edu\\\">The UCSB iCTF<\/a>, an international capture the flag event. The competition was great. The way it was set up allowed members like me, that aren't that skilled when it comes to IT security, to also contribute to the progress of one's team. I was particularly amused by a challenge that I was able to solve thanks to my occasional visits of \/b\/. <a href=\\\"img\/blog\/ictf.png\\\">Here<\/a>'s a picture of the challenge. Do you know the answer? If not, take a look at <a href=\\\"img\/blog\/haikus.jpg\\\">this<\/a>.<\/p><br \/><p>If that post gave you cancer go ahead and write a comment to tell me so!<\/p>","id":"9e40404a"},{"date":"2011-11-04","headline":"Parkour \/ Freerunning \/ Movement","image":"parkour.jpg","text":"<p>I always was that kind of guy who just <em>has to<\/em> jump over things, climb stuff and find physical challenges whenever being outside. Gone photographing, spotting some stones ... <em>\\\"Hold the camera please, I want to jump over these.\\\"<\/em> And <a href=\\\"img\/blog\/parkour2.jpg\\\">so I did<\/a>. <em>\\\"Do you think I could do this with one jump from standing position?\\\"<\/em>, <em>\\\"Wait, let's try to climb up there!\\\"<\/em> ... you get the idea. ; )<\/p><br \/><p>Yet, what I didn't have was some kind of sport that I did. As a kid I was in a gymnastics club. I quitted at the age of 12, I guess, and then, for a long, long time ... nothing. At 19 I tried to get into tricking but it didn't really work out. Tricking to me still is one of the &mdash; if not the &mdash; most beautiful expression of movement, though.<\/p><p>Early this year I got into slacklining, which I still like a lot and do occasionally. But what got me super excited the moment I started was parkour. Or freerunning, or whatever may describe it best what I'm doing. I really don't care a lot about definitions and categories. As long as it isn't necessary to rate or compare within a discipline you don't need to restrict yourself to a certain set of operations or comply to any regulations. And since I'm not driven by the thought <em>\\\"I wan't to be good at parkour\\\"<\/em> but instead <em>\\\"I wan't to do what makes me happy and what I think is fun\\\"<\/em> I just do that: moving and improving &mdash; in whatever way I like to. : )<\/p><br \/><p>What I find particularly interesting regarding parkour is the philosophy that developed around it. First there is the thought <em>\\\"never stop playing\\\"<\/em> and I couldn't identify more with it. Second there is the idea of creatively using (urban) spaces which I really like. It makes parkour kind of an art that's reaching into the spehre of everyday public life. Third there is this search for efficiency in not only movement but also thinking. It's really a whole bunch of good ideas and interestinng thought that comes along with parkour.<\/p><br \/><p>On top of that &mdash; one last incredibly important thing &mdash; the people are great. From what I've experienced so far, people that are into parkour tend to be extremely supportive, nice, open minded and fun. You'll get help if you need, everyone will encourage each other to try new things. It's just a great environment that supports one's authenticity.<\/p><br \/><p>Thus at the moment I'm a bit obsessed with parkour, freerunning, movement in genereal. May it remain like this for a long, long time. : )<\/p>","id":"5fd38d56"},{"date":"2011-10-14","headline":"Jae Rhim Lee's mushroom burial suit","image":"","text":"<object width=\\\"526\\\" height=\\\"374\\\"><param name=\\\"movie\\\" value=\\\"http:\/\/video.ted.com\/assets\/player\/swf\/EmbedPlayer.swf\\\"><\/param><param name=\\\"allowFullScreen\\\" value=\\\"true\\\" \/><param name=\\\"allowScriptAccess\\\" value=\\\"always\\\"\/><param name=\\\"wmode\\\" value=\\\"transparent\\\"><\/param><param name=\\\"bgColor\\\" value=\\\"#ffffff\\\"><\/param><param name=\\\"flashvars\\\" value=\\\"vu=http:\/\/video.ted.com\/talk\/stream\/2011G\/Blank\/JaeRhimLee_2011G-320k.mp4&su=http:\/\/images.ted.com\/images\/ted\/tedindex\/embed-posters\/JaeRhimLee_2011G-embed.jpg&vw=512&vh=288&ap=0&ti=1247&lang=eng&introDuration=15330&adDuration=4000&postAdDuration=830&adKeys=talk=jae_rhim_lee;year=2011;theme=a_taste_of_tedglobal_2011;theme=talks_from_ted_fellows;theme=a_greener_future;theme=technology_history_and_destiny;theme=new_on_ted_com;event=TEDGlobal+2011;tag=Arts;tag=Design;tag=death;tag=green;tag=invention;tag=ted+fellows;&preAdTag=tconf.ted\/embed;tile=1;sz=512x288;\\\" \/><embed src=\\\"http:\/\/video.ted.com\/assets\/player\/swf\/EmbedPlayer.swf\\\" pluginspace=\\\"http:\/\/www.macromedia.com\/go\/getflashplayer\\\" type=\\\"application\/x-shockwave-flash\\\" wmode=\\\"transparent\\\" bgColor=\\\"#ffffff\\\" width=\\\"526\\\" height=\\\"374\\\" allowFullScreen=\\\"true\\\" allowScriptAccess=\\\"always\\\" flashvars=\\\"vu=http:\/\/video.ted.com\/talk\/stream\/2011G\/Blank\/JaeRhimLee_2011G-320k.mp4&su=http:\/\/images.ted.com\/images\/ted\/tedindex\/embed-posters\/JaeRhimLee_2011G-embed.jpg&vw=512&vh=288&ap=0&ti=1247&lang=eng&introDuration=15330&adDuration=4000&postAdDuration=830&adKeys=talk=jae_rhim_lee;year=2011;theme=a_taste_of_tedglobal_2011;theme=talks_from_ted_fellows;theme=a_greener_future;theme=technology_history_and_destiny;theme=new_on_ted_com;event=TEDGlobal+2011;tag=Arts;tag=Design;tag=death;tag=green;tag=invention;tag=ted+fellows;&preAdTag=tconf.ted\/embed;tile=1;sz=512x288;\\\"><\/embed><\/object><p><strong>Watch it! Think about it!<\/strong><\/p><p>Wonderfully reasonable dealing with death. &lt;3<\/p>","id":"bbccacc0"},{"date":"2011-09-21","headline":"Facebook, three stages of infantilizing","image":"infantilizing.jpg","text":"<p><strong>Stage 1<\/strong> The \\\"News Feed\\\" is divided into \\\"Top news\\\" and \\\"Most recent\\\".<\/p><p>The so called \\\"Top News\\\" are a filtered version of all the news that come up. What is presented to you is, among other things I guess, based on the amount of likes and replies a status update or other news item gets.<\/p><p>If you don't want facebook to decide what news you get to see: only view \\\"Most recent\\\"<\/p><br \/><p><strong>Stage 2<\/strong> The news feed section \\\"Most recent\\\" has the option \\\"Show posts from:\\\" which can be set to \\\"Friends and pages you interact with the most\\\" or \\\"All of your friends and pages\\\".<\/p><p>Again ... Facebook filters. This time according to the amout of interaction you had with the persons in your contact list via Facebook.<\/p><br \/><p><strong>Stage 3<\/strong> For every person in your contact list you lately have a so called subscription. The default setting for such a subsbsription is \\\"Most Updates\\\". (Options are \\\"All updates\\\", \\\"Most Updates\\\" and \\\"Only Important\\\").<\/p><p>And again: why should the user care about all updates and decide for himself, what is important to him and what is not? Let's change the news feed and again cut out stuff that we — Facebook — think is unimportant. <strong>Argh, I hate it!<\/strong><\/p><br \/><br \/><p>Personalized filtering is an interesting thing and, in my humble opinion, even necessary in our days of information oversupply. But I really can not stand it when service providers <em><strong>by default<\/strong><\/em> hold back information, filter your input, infantilize their users.<\/p><br \/><p>To be fair: it's nice that Facebook at least let's you change the filtering &mdash; I don't want to know how much filtering is done without us knowing about it. But neither have I stumbled across an option to set the default for all subscriptions to \\\"All updates\\\" yet, nor am I inclined to change this for all my Facebook contacts manually.<\/p><br \/><br \/><p><strong>Update:<\/strong><\/p><p>What the ...?! Less than two hours after I blogged this:<\/p><br \/><img src=\\\"img\/blog\/infantilizing2.jpg\\\" \/><br \/><br \/><p><strong>Fuck your goddamn preselection! I want fucking <em>ALL<\/em> my news in fucking chronological order.<\/strong> *facebookrage*<\/p>","id":"ab2c19b1"},{"date":"2011-09-14","headline":"Bad-ass movielist","image":"movielist.jpg","text":"<p><strong><em>Level up!<\/em><\/strong> for the cinephile. I rebuilt\/improved my movielist. : )<\/p><br \/><p>The old list contained title, year and duration in a rather mediocre conceived notation. Now I note title, year and IMDb id. The first two to still have something human readable and independent from external sources, the third to gather all further data.<\/p><br \/><p>To access the IMDb page I use <a href=\\\"http:\/\/projects.izzysoft.de\/trac\/imdbphp\\\">IMDBPHP<\/a>, but the methods to sort out the data (rating, runtime, director, etc.) are self written. Since the process of accessing every single IMDb page (one for each movie) takes quite some time, my script saves all information as well as the image in a cache folder.<\/p><br \/><p>The list can be accessed <a href=\\\"src\/movielist\/movies.php\\\">here<\/a>.<\/p>","id":"132c1dbb"},{"date":"2011-07-24","headline":"Stop motion &mdash; a first try","image":"","text":"<p>Took me about 90 minutes to take the pictures.<\/p>\".youtube('87WgoUNw_rI').\"","id":"3f3e1a7e"},{"date":"2011-07-11","headline":"You are leaving the internet","image":"leaving.jpg","text":"<p>Using a forum that has one of these redirection pages for external links that tells you, that you're leaving the site, I lately thought of annoying others by repetitively pasting the link to the redirection page linking to itself before the actual site I was linking to. You'd have to wait for a series of useless pseudo redirections or copy the actual link manually.<\/p><br \/><p>Then, however, I thought you could do something way cooler with <em>&quot;You are leaving&quot;<\/em>-pages from different sites. You could create a tour, leaving one page after the other &mdash; you could be: <a href=\\\"http:\/\/www.intelsols.com\/linkexit.cfm?exittitle=__________________________________________________%20_____________________________________________________________________________%20___________________AN_AWESOME_TOUR_TROUGH_LEAVING_PAGES_____________________%20_____________________________________________________________________________%20__________________________ASSEMBLED_BY_ILLDEPENCE_____________________________%20_____________________________________________________________________________&exiturl=http%3A\/\/www.gliderol.co.uk\/redirect.php?url=www.bristol.airqualitydata.com\/cgi-bin\/externallink.cgi?antarcticsun.usap.gov\/externalsite.cfm?http%3A\/\/www.openholidayguide.de\/redirect.php?url=area17aa.org\/area17\/redirect.php?url=http%3A\/\/athleteprofessional.com\/engine\/redirect.php?url=http%3A\/\/www.sendasign-halbe.de\/goto.php?url=http%3A\/\/www.khsd.k12.ca.us\/Redirector.aspx?RedirectUrl=www.penspinning.de\/ref.php?url=https%3A\/\/www.rabobankamerica.com\/leaving_site.jsp?url=http%3A\/\/dontknow.me\/at\/?http%3A\/\/www.studivz.net\/Link\/Dereferer\/?http%3A\/\/www.mobilephonestore.net\/redirect.php?url=http%3A\/\/www.webstyles-chinese.info\/track.php?l=www.schuelervz.net\/Link\/Dereferer\/?http%3A\/\/communitygarden.info\/redirect.php?url=www.usphs.gov\/redirect.aspx?URL=http:\/\/robocaster.com\/redir.aspx?http%3A\/\/tareksaier.bplaced.net\\\"><strong><em>leaving the internet<\/em><\/strong><\/a>.<\/p><br \/><p>See you soon!<\/p><!-- taken out cause down mobiwar.ru\/engine\/redirect.php?url= -->","id":"1c5bf081"},{"date":"2011-07-10","headline":"The Elegance of the Hedgehog (Die Eleganz des Igels)","image":"igel.jpg","text":"<p>A fortunate coincidence &mdash; or maybe a great estimation of what would be suitable for my person. : )<\/p><br \/><p>I mostly read textbooks, in the majority of cases about philosophy. Somehow novels aren't the kind of books that usually catch my attention. Sadly, because ... not enjoying something is in some way missing something.<\/p><p>I loved the <em>Hitchhiker's Guide to the Galaxy<\/em> series, enjoyed Stefan Zweig's <em>The Royal Game<\/em> and occasionally read manga. But the rest of what I've read so far ... Precht, Dawkins, Postman, Watzlawick, Nietzsche, etc. &mdash; therefore I'm always keen on finding novels I like.<\/p><br \/><p>Last saturday a friend of mine lent me <em>The Elegance of the Hedgehog<\/em> (amazon<a href=\\\"http:\/\/www.amazon.com\/dp\/1933372605\\\">.com<\/a>\/<a href=\\\"http:\/\/www.amazon.de\/dp\/3423138149\\\">.de<\/a>). She once cited a passage from the book in an e-mail. It looked promising, I got interested. As it turned out this book &mdash; at least in my opinion &mdash; is <em>just perfect<\/em> for a person which enjoys reading analytical, philosophical works. It has a touch of such works, yet tells a story, keeps you interestend, is written gorgeously and altogether is just a wonderful book. *recommended*<\/p>","id":"04e9b323"},{"date":"2011-07-10","headline":"Google+","image":"gplus.jpg","text":"<p><strong>&quot;And then, one day, I got in!&quot;<\/strong> (quote from Tron: Legacy)<\/p><p>&mdash; And you should come in, too!<\/p><p>I've been playing around with Google+ for three days now. Aside from the fact, that Google+ is made by Google, which is reason enough to join, I have to say I really like it. Yes it is <a href=\\\"http:\/\/xkcd.com\/918\\\">quite simmilar to Facebook<\/a>, but hey: it's a social network and at the moment Facebook is by far the most successful one. If Google+ wasn't quite like Facebook it had to be ... revolutionary &mdash; which it is not. But it definitely is woth trying out and as soon as the integration of other Google services is pushed forward, the answer to the question <em>&quot;Which social network should I use?&quot;<\/em> is, not only based on image but also based on functionality, <strong>Google+<\/strong>.<\/p><br \/><p>Interesting stuff: <a href=\\\"http:\/\/insidegoogleplus.de\\\">Inside Google Plus<\/a> (a German blog) and <a href=\\\"https:\/\/docs.google.com\/document\/d\/1cUjZ_7rlAmKRDVB6GXId73h_eUdXGKdjtSff0svbaz0\/preview?hl=de&pli=1&sle=true\\\">Google+ Tips and Tricks<\/a> (a collaborative document).<\/p><br \/><p>If you want to be invited: just send me your e-mail address. ; )<\/p>","id":"a403a8c7"},{"date":"2011-06-23","headline":"Renovation, again.","image":"renovation.jpg","text":"<p>Uhm, yes ... I had to change it again. To be more precise: I built the site again pretty much from scratch. It's as if everytime I remake my page and use it for some time, I find new flaws and the desire to start all over again rises. ^^<\/p><p>This time I didn't make any major steps concerning technology &mdash; only added a little javascript. The look however changed quite a bit: centered again, uniform color, a picture in the header, different categories and no more name or title (like <em>&amp;code<\/em> before). Greatest changes however were made concerning content. I overhauled most of it.<\/p><br \/><p>Oh and: old entries are old. I'm not going to import them ... this is gonna be kind of a new beginning. : )<\/p>","id":"dc18fc96"},{"text":"<p>On and on it goes ... 97 kanji and 253 words since the last post.<\/p>\r\n<br \/>\r\n<p>I was quite surprised that I missed the '100 kanji per month' mark by just one day (and just one kanji, acutally — I was at 499 yesterday). Anyway, everything good, no changes as for how I learn and here are my <a href=\\\"img\/blog\/anki_stats_131210.png\\\">Anki stats<\/a>.<\/p>\r\n<br \/>\r\n<p>Gammar! After I finished my <a href=\\\"http:\/\/moc.sirtetris.com\/grammar_rush\/\\\">\\\"grammar rush\\\"<\/a> I stated a <a href=\\\"http:\/\/moc.sirtetris.com\/re_rush\/\\\">\\\"re rush\\\"<\/a>. Turned out to be a good strategy so far. No idea what I will do after that though. Maybe start with writing full texts instead of single sentences. Maybe focus on speaking and reduce the time I spent on writing for a while ... we'll see.<\/p>\r\n<br \/>\r\n<p>Oh and the guys from <a href=\\\"http:\/\/lang-8.com\/\\\">Lang-8<\/a> (where I'll write my 100th entry today) are super nice! I found a vulnerability on their site, reported it and they gave me one year premium for my account. :3<\/p>\r\n<br \/>\r\n<p>As always, for the sake of documentation, these are the kanji I know so far:<\/p>\r\n<p>一右雨円王音下火花貝学気休玉金九空月犬見五口校左三山四子糸字耳七車手十出女小上森人水正生青石赤先千川早草足村大男竹中虫町天田土二日入年白八百文本名木目夕立力林六雲園黄何夏家歌画会回海絵外楽間顔帰汽記弓牛魚京強教近兄形計元原言古戸午後語交光公工考行高合国黒今作姉市思止紙寺時自室社弱首秋週春書少場色食心新親図数星声西切前走多太体台谷知地朝長鳥直弟店点電冬刀東当答頭同読内南肉馬買売半番父風分聞米歩母方北妹毎万明門夜矢友曜用来理里話悪安暗意医員飲運駅央横屋温化界開階寒感漢館起急去業局曲銀具君軽祭皿仕使始死詩事持式実写者主取受終住重宿所申真神身進世全息速族待代第題短着注庭鉄転都度島豆動倍反美品部服物平返勉味命面問薬有由遊様洋羊葉陽旅両緑列和愛以衣英果官泣共訓軍欠結建験好最昨察札殺散史氏試辞失周初信静然争束続達置的典徒働飯必不付夫変便法末未民無約要利料良令例冷歴易因可過逆居句険現際在罪雑師志示質授術招常制舌張独犯比非婦弁映干危机貴供敬警穴己孝私至詞誌尺若垂寸窓存暖段値難俳秘亡忘枚密訳郵欲卵律亜違越猿介皆較頑吉詰更江項婚歳撮侍趣紹丈寝辛占替遅超廷斗猫彼苗僕又漫娘免厄与裸竜恋闇俺亀巾誰爪箸枕也亦巴狼頁帚勺<\/p>","id":"7b41827f","date":"2013-12-10","headline":"漢字 — 500+","image":"kanji_checkpoint_5.png"}]